_posts/2022-03-08-post-recon.html
---
title:  Playing with new and old Tools
categories:
  - blog
tags:
    - recon
---

<p>
Today I used some new tools, and got a better understanding for some tools I already use:
Furthermore I learned how to access an vhost, if it is not resolved via DNS, which is simple but new to me&#x2026;
Adding the "Host: xxx.domain.com" into the header does the trick. All that with just two exersices on Pentesterlab, there is still much to learn
</p>

<div id="outline-container-orgcb883e7" class="outline-2">
<h2 id="orgcb883e7">Aquatone</h2>
<div class="outline-text-2" id="text-orgcb883e7">
<p>
Honestly I still very surprised, how amazing these recon tools are, they are much better than I ever expected.
Simple, fast and powerful
</p>

<p>
<a href="https://github.com/michenriksen/aquatone">https://github.com/michenriksen/aquatone</a>
</p>
</div>
</div>

<div id="outline-container-orgd139592" class="outline-2">
<h2 id="orgd139592">Sublist3r</h2>
<div class="outline-text-2" id="text-orgd139592">
<p>
Just the first start has already shown that this is quite fast, but there are more features to discover.
</p>

<p>
<a href="https://github.com/aboul3la/Sublist3r">https://github.com/aboul3la/Sublist3r</a>
</p>
</div>
</div>

<div id="outline-container-orgf2d6701" class="outline-2">
<h2 id="orgf2d6701">Gobuster</h2>
<div class="outline-text-2" id="text-orgf2d6701">
<p>
Already often used and loved, today I discoverd that I can also use the same tool for brutefocing dns and vhosts, not only directories.
</p>
</div>
</div>
